GopalSaraf/Practicals/PSDL/include/proc/pic18f14q41.h
extern volatile PMD1bits_t PMD1bits __at(0x064);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_SMT1MD_POSN                                   0x5
#define _PMD1_SMT1MD_POSITION                               0x5
#define _PMD1_SMT1MD_SIZE                                   0x1
#define _PMD1_SMT1MD_LENGTH                                 0x1
#define _PMD1_SMT1MD_MASK                                   0x20
#define _PMD1_ZCDMD_POSN                                    0x6
#define _PMD1_ZCDMD_POSITION                                0x6
#define _PMD1_ZCDMD_SIZE                                    0x1
#define _PMD1_ZCDMD_LENGTH                                  0x1
#define _PMD1_ZCDMD_MASK                                    0x40
#define _PMD1_CM1MD_POSN                                    0x7
#define _PMD1_CM1MD_POSITION                                0x7
#define _PMD1_CM1MD_SIZE                                    0x1
#define _PMD1_CM1MD_LENGTH                                  0x1
#define _PMD1_CM1MD_MASK                                    0x80

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x065);
#ifndef _LIB_BUILD
asm("PMD2 equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM2MD                  :1;
        unsigned ADCMD                  :1;
        unsigned DAC1MD                 :1;
        unsigned ACTMD                  :1;
        unsigned NCO1MD                 :1;
        unsigned DSM1MD                 :1;
        unsigned CWG1MD                 :1;
        unsigned CCP1MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x065);
// bitfield macros
#define _PMD2_CM2MD_POSN                                    0x0
#define _PMD2_CM2MD_POSITION                                0x0
#define _PMD2_CM2MD_SIZE                                    0x1
#define _PMD2_CM2MD_LENGTH                                  0x1
#define _PMD2_CM2MD_MASK                                    0x1
#define _PMD2_ADCMD_POSN                                    0x1
#define _PMD2_ADCMD_POSITION                                0x1
#define _PMD2_ADCMD_SIZE                                    0x1
#define _PMD2_ADCMD_LENGTH                                  0x1
#define _PMD2_ADCMD_MASK                                    0x2
#define _PMD2_DAC1MD_POSN                                   0x2
#define _PMD2_DAC1MD_POSITION                               0x2
#define _PMD2_DAC1MD_SIZE                                   0x1
#define _PMD2_DAC1MD_LENGTH                                 0x1
#define _PMD2_DAC1MD_MASK                                   0x4
#define _PMD2_ACTMD_POSN                                    0x3
#define _PMD2_ACTMD_POSITION                                0x3
#define _PMD2_ACTMD_SIZE                                    0x1
#define _PMD2_ACTMD_LENGTH                                  0x1
#define _PMD2_ACTMD_MASK                                    0x8
#define _PMD2_NCO1MD_POSN                                   0x4
#define _PMD2_NCO1MD_POSITION                               0x4
#define _PMD2_NCO1MD_SIZE                                   0x1
#define _PMD2_NCO1MD_LENGTH                                 0x1
#define _PMD2_NCO1MD_MASK                                   0x10
#define _PMD2_DSM1MD_POSN                                   0x5
#define _PMD2_DSM1MD_POSITION                               0x5
#define _PMD2_DSM1MD_SIZE                                   0x1
#define _PMD2_DSM1MD_LENGTH                                 0x1
#define _PMD2_DSM1MD_MASK                                   0x20
#define _PMD2_CWG1MD_POSN                                   0x6
#define _PMD2_CWG1MD_POSITION                               0x6
#define _PMD2_CWG1MD_SIZE                                   0x1
#define _PMD2_CWG1MD_LENGTH                                 0x1
#define _PMD2_CWG1MD_MASK                                   0x40
#define _PMD2_CCP1MD_POSN                                   0x7
#define _PMD2_CCP1MD_POSITION                               0x7
#define _PMD2_CCP1MD_SIZE                                   0x1
#define _PMD2_CCP1MD_LENGTH                                 0x1
#define _PMD2_CCP1MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x066);
#ifndef _LIB_BUILD
asm("PMD3 equ 066h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1MD                 :1;
        unsigned PWM2MD                 :1;
        unsigned PWM3MD                 :1;
        unsigned I2C1MD                 :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x066);
// bitfield macros
#define _PMD3_PWM1MD_POSN                                   0x0
#define _PMD3_PWM1MD_POSITION                               0x0
#define _PMD3_PWM1MD_SIZE                                   0x1
#define _PMD3_PWM1MD_LENGTH                                 0x1
#define _PMD3_PWM1MD_MASK                                   0x1
#define _PMD3_PWM2MD_POSN                                   0x1
#define _PMD3_PWM2MD_POSITION                               0x1
#define _PMD3_PWM2MD_SIZE                                   0x1
#define _PMD3_PWM2MD_LENGTH                                 0x1
#define _PMD3_PWM2MD_MASK                                   0x2
#define _PMD3_PWM3MD_POSN                                   0x2
#define _PMD3_PWM3MD_POSITION                               0x2
#define _PMD3_PWM3MD_SIZE                                   0x1
#define _PMD3_PWM3MD_LENGTH                                 0x1
#define _PMD3_PWM3MD_MASK                                   0x4
#define _PMD3_I2C1MD_POSN                                   0x3
#define _PMD3_I2C1MD_POSITION                               0x3
#define _PMD3_I2C1MD_SIZE                                   0x1
#define _PMD3_I2C1MD_LENGTH                                 0x1
#define _PMD3_I2C1MD_MASK                                   0x8
#define _PMD3_SPI1MD_POSN                                   0x4
#define _PMD3_SPI1MD_POSITION                               0x4
#define _PMD3_SPI1MD_SIZE                                   0x1
#define _PMD3_SPI1MD_LENGTH                                 0x1
#define _PMD3_SPI1MD_MASK                                   0x10
#define _PMD3_SPI2MD_POSN                                   0x5
#define _PMD3_SPI2MD_POSITION                               0x5
#define _PMD3_SPI2MD_SIZE                                   0x1
#define _PMD3_SPI2MD_LENGTH                                 0x1
#define _PMD3_SPI2MD_MASK                                   0x20
#define _PMD3_U1MD_POSN                                     0x6
#define _PMD3_U1MD_POSITION                                 0x6
#define _PMD3_U1MD_SIZE                                     0x1
#define _PMD3_U1MD_LENGTH                                   0x1
#define _PMD3_U1MD_MASK                                     0x40
#define _PMD3_U2MD_POSN                                     0x7
#define _PMD3_U2MD_POSITION                                 0x7
#define _PMD3_U2MD_SIZE                                     0x1
#define _PMD3_U2MD_LENGTH                                   0x1
#define _PMD3_U2MD_MASK                                     0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x067);
#ifndef _LIB_BUILD
asm("PMD4 equ 067h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3MD                   :1;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
        unsigned DMA3MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x067);
// bitfield macros
#define _PMD4_U3MD_POSN                                     0x0
#define _PMD4_U3MD_POSITION                                 0x0
#define _PMD4_U3MD_SIZE                                     0x1
#define _PMD4_U3MD_LENGTH                                   0x1
#define _PMD4_U3MD_MASK                                     0x1
#define _PMD4_CLC1MD_POSN                                   0x1
#define _PMD4_CLC1MD_POSITION                               0x1
#define _PMD4_CLC1MD_SIZE                                   0x1
#define _PMD4_CLC1MD_LENGTH                                 0x1
#define _PMD4_CLC1MD_MASK                                   0x2
#define _PMD4_CLC2MD_POSN                                   0x2
#define _PMD4_CLC2MD_POSITION                               0x2
#define _PMD4_CLC2MD_SIZE                                   0x1
#define _PMD4_CLC2MD_LENGTH                                 0x1
#define _PMD4_CLC2MD_MASK                                   0x4
#define _PMD4_CLC3MD_POSN                                   0x3
#define _PMD4_CLC3MD_POSITION                               0x3
#define _PMD4_CLC3MD_SIZE                                   0x1
#define _PMD4_CLC3MD_LENGTH                                 0x1
#define _PMD4_CLC3MD_MASK                                   0x8
#define _PMD4_CLC4MD_POSN                                   0x4
#define _PMD4_CLC4MD_POSITION                               0x4
#define _PMD4_CLC4MD_SIZE                                   0x1
#define _PMD4_CLC4MD_LENGTH                                 0x1
#define _PMD4_CLC4MD_MASK                                   0x10
#define _PMD4_DMA1MD_POSN                                   0x5
#define _PMD4_DMA1MD_POSITION                               0x5
#define _PMD4_DMA1MD_SIZE                                   0x1
#define _PMD4_DMA1MD_LENGTH                                 0x1
#define _PMD4_DMA1MD_MASK                                   0x20
#define _PMD4_DMA2MD_POSN                                   0x6
#define _PMD4_DMA2MD_POSITION                               0x6
#define _PMD4_DMA2MD_SIZE                                   0x1
#define _PMD4_DMA2MD_LENGTH                                 0x1
#define _PMD4_DMA2MD_MASK                                   0x40
#define _PMD4_DMA3MD_POSN                                   0x7
#define _PMD4_DMA3MD_POSITION                               0x7
#define _PMD4_DMA3MD_SIZE                                   0x1
#define _PMD4_DMA3MD_LENGTH                                 0x1
#define _PMD4_DMA3MD_MASK                                   0x80

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x068);
#ifndef _LIB_BUILD
asm("PMD5 equ 068h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA4MD                 :1;
        unsigned DAC2MD                 :1;
        unsigned OPAMD                  :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x068);
// bitfield macros
#define _PMD5_DMA4MD_POSN                                   0x0
#define _PMD5_DMA4MD_POSITION                               0x0
#define _PMD5_DMA4MD_SIZE                                   0x1
#define _PMD5_DMA4MD_LENGTH                                 0x1
#define _PMD5_DMA4MD_MASK                                   0x1
#define _PMD5_DAC2MD_POSN                                   0x1
#define _PMD5_DAC2MD_POSITION                               0x1
#define _PMD5_DAC2MD_SIZE                                   0x1
#define _PMD5_DAC2MD_LENGTH                                 0x1
#define _PMD5_DAC2MD_MASK                                   0x2
#define _PMD5_OPAMD_POSN                                    0x2
#define _PMD5_OPAMD_POSITION                                0x2
#define _PMD5_OPAMD_SIZE                                    0x1
#define _PMD5_OPAMD_LENGTH                                  0x1
#define _PMD5_OPAMD_MASK                                    0x4

// Register: MD1CON0
#define MD1CON0 MD1CON0
extern volatile unsigned char           MD1CON0             __at(0x06A);
#ifndef _LIB_BUILD
asm("MD1CON0 equ 06Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD1BIT                 :1;
        unsigned                        :3;
        unsigned MD1OPOL                :1;
        unsigned MD1OUT                 :1;
        unsigned                        :1;
        unsigned MD1EN                  :1;
    };
} MD1CON0bits_t;
extern volatile MD1CON0bits_t MD1CON0bits __at(0x06A);
// bitfield macros
#define _MD1CON0_BIT_POSN                                   0x0
#define _MD1CON0_BIT_POSITION                               0x0
#define _MD1CON0_BIT_SIZE                                   0x1
#define _MD1CON0_BIT_LENGTH                                 0x1
#define _MD1CON0_BIT_MASK                                   0x1
#define _MD1CON0_OPOL_POSN                                  0x4
#define _MD1CON0_OPOL_POSITION                              0x4
#define _MD1CON0_OPOL_SIZE                                  0x1
#define _MD1CON0_OPOL_LENGTH                                0x1
#define _MD1CON0_OPOL_MASK                                  0x10
#define _MD1CON0_OUT_POSN                                   0x5
#define _MD1CON0_OUT_POSITION                               0x5
#define _MD1CON0_OUT_SIZE                                   0x1
#define _MD1CON0_OUT_LENGTH                                 0x1
#define _MD1CON0_OUT_MASK                                   0x20
#define _MD1CON0_EN_POSN                                    0x7
#define _MD1CON0_EN_POSITION                                0x7
#define _MD1CON0_EN_SIZE                                    0x1
#define _MD1CON0_EN_LENGTH                                  0x1
#define _MD1CON0_EN_MASK                                    0x80
#define _MD1CON0_MD1BIT_POSN                                0x0
#define _MD1CON0_MD1BIT_POSITION                            0x0
#define _MD1CON0_MD1BIT_SIZE                                0x1
#define _MD1CON0_MD1BIT_LENGTH                              0x1
#define _MD1CON0_MD1BIT_MASK                                0x1
#define _MD1CON0_MD1OPOL_POSN                               0x4
#define _MD1CON0_MD1OPOL_POSITION                           0x4
#define _MD1CON0_MD1OPOL_SIZE                               0x1
#define _MD1CON0_MD1OPOL_LENGTH                             0x1
#define _MD1CON0_MD1OPOL_MASK                               0x10
#define _MD1CON0_MD1OUT_POSN                                0x5
#define _MD1CON0_MD1OUT_POSITION                            0x5
#define _MD1CON0_MD1OUT_SIZE                                0x1
#define _MD1CON0_MD1OUT_LENGTH                              0x1
#define _MD1CON0_MD1OUT_MASK                                0x20
#define _MD1CON0_MD1EN_POSN                                 0x7
#define _MD1CON0_MD1EN_POSITION                             0x7
#define _MD1CON0_MD1EN_SIZE                                 0x1
#define _MD1CON0_MD1EN_LENGTH                               0x1
#define _MD1CON0_MD1EN_MASK                                 0x80

