GopalSaraf/Practicals/PSDL/include/proc/pic18f14q41.h
extern volatile I2C1BTOCbits_t I2C1BTOCbits __at(0x29F);
// bitfield macros
#define _I2C1BTOC_BTOC_POSN                                 0x0
#define _I2C1BTOC_BTOC_POSITION                             0x0
#define _I2C1BTOC_BTOC_SIZE                                 0x4
#define _I2C1BTOC_BTOC_LENGTH                               0x4
#define _I2C1BTOC_BTOC_MASK                                 0xF
#define _I2C1BTOC_I2CBTOC_POSN                              0x0
#define _I2C1BTOC_I2CBTOC_POSITION                          0x0
#define _I2C1BTOC_I2CBTOC_SIZE                              0x4
#define _I2C1BTOC_I2CBTOC_LENGTH                            0x4
#define _I2C1BTOC_I2CBTOC_MASK                              0xF
#define _I2C1BTOC_BTOC0_POSN                                0x0
#define _I2C1BTOC_BTOC0_POSITION                            0x0
#define _I2C1BTOC_BTOC0_SIZE                                0x1
#define _I2C1BTOC_BTOC0_LENGTH                              0x1
#define _I2C1BTOC_BTOC0_MASK                                0x1
#define _I2C1BTOC_BTOC1_POSN                                0x1
#define _I2C1BTOC_BTOC1_POSITION                            0x1
#define _I2C1BTOC_BTOC1_SIZE                                0x1
#define _I2C1BTOC_BTOC1_LENGTH                              0x1
#define _I2C1BTOC_BTOC1_MASK                                0x2
#define _I2C1BTOC_BTOC2_POSN                                0x2
#define _I2C1BTOC_BTOC2_POSITION                            0x2
#define _I2C1BTOC_BTOC2_SIZE                                0x1
#define _I2C1BTOC_BTOC2_LENGTH                              0x1
#define _I2C1BTOC_BTOC2_MASK                                0x4
#define _I2C1BTOC_BTOC3_POSN                                0x3
#define _I2C1BTOC_BTOC3_POSITION                            0x3
#define _I2C1BTOC_BTOC3_SIZE                                0x1
#define _I2C1BTOC_BTOC3_LENGTH                              0x1
#define _I2C1BTOC_BTOC3_MASK                                0x8
#define _I2C1BTOC_I2CBTOC0_POSN                             0x0
#define _I2C1BTOC_I2CBTOC0_POSITION                         0x0
#define _I2C1BTOC_I2CBTOC0_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC0_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC0_MASK                             0x1
#define _I2C1BTOC_I2CBTOC1_POSN                             0x1
#define _I2C1BTOC_I2CBTOC1_POSITION                         0x1
#define _I2C1BTOC_I2CBTOC1_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC1_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC1_MASK                             0x2
#define _I2C1BTOC_I2CBTOC2_POSN                             0x2
#define _I2C1BTOC_I2CBTOC2_POSITION                         0x2
#define _I2C1BTOC_I2CBTOC2_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC2_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC2_MASK                             0x4
#define _I2C1BTOC_I2CBTOC3_POSN                             0x3
#define _I2C1BTOC_I2CBTOC3_POSITION                         0x3
#define _I2C1BTOC_I2CBTOC3_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC3_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC3_MASK                             0x8

// Register: U1RXB
#define U1RXB U1RXB
extern volatile unsigned char           U1RXB               __at(0x2A1);
#ifndef _LIB_BUILD
asm("U1RXB equ 02A1h");
#endif
// aliases
extern volatile unsigned char           U1RXBL              __at(0x2A1);
#ifndef _LIB_BUILD
asm("U1RXBL equ 02A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBbits_t;
extern volatile U1RXBbits_t U1RXBbits __at(0x2A1);
// bitfield macros
#define _U1RXB_RXB_POSN                                     0x0
#define _U1RXB_RXB_POSITION                                 0x0
#define _U1RXB_RXB_SIZE                                     0x8
#define _U1RXB_RXB_LENGTH                                   0x8
#define _U1RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBLbits_t;
extern volatile U1RXBLbits_t U1RXBLbits __at(0x2A1);
// bitfield macros
#define _U1RXBL_RXB_POSN                                    0x0
#define _U1RXBL_RXB_POSITION                                0x0
#define _U1RXBL_RXB_SIZE                                    0x8
#define _U1RXBL_RXB_LENGTH                                  0x8
#define _U1RXBL_RXB_MASK                                    0xFF

// Register: U1RXCHK
#define U1RXCHK U1RXCHK
extern volatile unsigned char           U1RXCHK             __at(0x2A2);
#ifndef _LIB_BUILD
asm("U1RXCHK equ 02A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXCHK                  :8;
    };
} U1RXCHKbits_t;
extern volatile U1RXCHKbits_t U1RXCHKbits __at(0x2A2);
// bitfield macros
#define _U1RXCHK_RXCHK_POSN                                 0x0
#define _U1RXCHK_RXCHK_POSITION                             0x0
#define _U1RXCHK_RXCHK_SIZE                                 0x8
#define _U1RXCHK_RXCHK_LENGTH                               0x8
#define _U1RXCHK_RXCHK_MASK                                 0xFF

// Register: U1TXB
#define U1TXB U1TXB
extern volatile unsigned char           U1TXB               __at(0x2A3);
#ifndef _LIB_BUILD
asm("U1TXB equ 02A3h");
#endif
// aliases
extern volatile unsigned char           U1TXBL              __at(0x2A3);
#ifndef _LIB_BUILD
asm("U1TXBL equ 02A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBbits_t;
extern volatile U1TXBbits_t U1TXBbits __at(0x2A3);
// bitfield macros
#define _U1TXB_TXB_POSN                                     0x0
#define _U1TXB_TXB_POSITION                                 0x0
#define _U1TXB_TXB_SIZE                                     0x8
#define _U1TXB_TXB_LENGTH                                   0x8
#define _U1TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBLbits_t;
extern volatile U1TXBLbits_t U1TXBLbits __at(0x2A3);
// bitfield macros
#define _U1TXBL_TXB_POSN                                    0x0
#define _U1TXBL_TXB_POSITION                                0x0
#define _U1TXBL_TXB_SIZE                                    0x8
#define _U1TXBL_TXB_LENGTH                                  0x8
#define _U1TXBL_TXB_MASK                                    0xFF

