GopalSaraf/Practicals/PSDL/include/proc/pic18f14q41.h
#define                                 SPI1SCKPPS1_bit     _BIT_ACCESS(SPI1SCKPPS,1)
// SPI1SCKPPS<SPI1SCKPPS2>
extern volatile __bit                   SPI1SCKPPS2         __at(0x1352);	// @ (0x26A * 8 + 2)
#define                                 SPI1SCKPPS2_bit     _BIT_ACCESS(SPI1SCKPPS,2)
// SPI1SCKPPS<SPI1SCKPPS3>
extern volatile __bit                   SPI1SCKPPS3         __at(0x1353);	// @ (0x26A * 8 + 3)
#define                                 SPI1SCKPPS3_bit     _BIT_ACCESS(SPI1SCKPPS,3)
// SPI1SCKPPS<SPI1SCKPPS4>
extern volatile __bit                   SPI1SCKPPS4         __at(0x1354);	// @ (0x26A * 8 + 4)
#define                                 SPI1SCKPPS4_bit     _BIT_ACCESS(SPI1SCKPPS,4)
// SPI1SCKPPS<SPI1SCKPPS5>
extern volatile __bit                   SPI1SCKPPS5         __at(0x1355);	// @ (0x26A * 8 + 5)
#define                                 SPI1SCKPPS5_bit     _BIT_ACCESS(SPI1SCKPPS,5)
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x429);	// @ (0x85 * 8 + 1)
#define                                 SPI1SDIP_bit        _BIT_ACCESS(SPI1CON1,1)
// SPI1SDIPPS<SPI1SDIPPS0>
extern volatile __bit                   SPI1SDIPPS0         __at(0x1358);	// @ (0x26B * 8 + 0)
#define                                 SPI1SDIPPS0_bit     _BIT_ACCESS(SPI1SDIPPS,0)
// SPI1SDIPPS<SPI1SDIPPS1>
extern volatile __bit                   SPI1SDIPPS1         __at(0x1359);	// @ (0x26B * 8 + 1)
#define                                 SPI1SDIPPS1_bit     _BIT_ACCESS(SPI1SDIPPS,1)
// SPI1SDIPPS<SPI1SDIPPS2>
extern volatile __bit                   SPI1SDIPPS2         __at(0x135A);	// @ (0x26B * 8 + 2)
#define                                 SPI1SDIPPS2_bit     _BIT_ACCESS(SPI1SDIPPS,2)
// SPI1SDIPPS<SPI1SDIPPS3>
extern volatile __bit                   SPI1SDIPPS3         __at(0x135B);	// @ (0x26B * 8 + 3)
#define                                 SPI1SDIPPS3_bit     _BIT_ACCESS(SPI1SDIPPS,3)
// SPI1SDIPPS<SPI1SDIPPS4>
extern volatile __bit                   SPI1SDIPPS4         __at(0x135C);	// @ (0x26B * 8 + 4)
#define                                 SPI1SDIPPS4_bit     _BIT_ACCESS(SPI1SDIPPS,4)
// SPI1SDIPPS<SPI1SDIPPS5>
extern volatile __bit                   SPI1SDIPPS5         __at(0x135D);	// @ (0x26B * 8 + 5)
#define                                 SPI1SDIPPS5_bit     _BIT_ACCESS(SPI1SDIPPS,5)
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 SPI1SDOP_bit        _BIT_ACCESS(SPI1CON1,0)
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x42F);	// @ (0x85 * 8 + 7)
#define                                 SPI1SMP_bit         _BIT_ACCESS(SPI1CON1,7)
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x45D);	// @ (0x8B * 8 + 5)
#define                                 SPI1SOSIE_bit       _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x455);	// @ (0x8A * 8 + 5)
#define                                 SPI1SOSIF_bit       _BIT_ACCESS(SPI1INTF,5)
// SPI1CON0<SPI1SPIEN>
extern volatile __bit                   SPI1SPIEN           __at(0x427);	// @ (0x84 * 8 + 7)
#define                                 SPI1SPIEN_bit       _BIT_ACCESS(SPI1CON0,7)
// SPI1INTE<SPI1SRMTIE>
extern volatile __bit                   SPI1SRMTIE          __at(0x45F);	// @ (0x8B * 8 + 7)
#define                                 SPI1SRMTIE_bit      _BIT_ACCESS(SPI1INTE,7)
// SPI1INTF<SPI1SRMTIF>
extern volatile __bit                   SPI1SRMTIF          __at(0x457);	// @ (0x8A * 8 + 7)
#define                                 SPI1SRMTIF_bit      _BIT_ACCESS(SPI1INTF,7)
// SPI1CON2<SPI1SSET>
extern volatile __bit                   SPI1SSET            __at(0x432);	// @ (0x86 * 8 + 2)
#define                                 SPI1SSET_bit        _BIT_ACCESS(SPI1CON2,2)
// SPI1CON2<SPI1SSFLT>
extern volatile __bit                   SPI1SSFLT           __at(0x436);	// @ (0x86 * 8 + 6)
#define                                 SPI1SSFLT_bit       _BIT_ACCESS(SPI1CON2,6)
// SPI1CON1<SPI1SSP>
extern volatile __bit                   SPI1SSP             __at(0x42A);	// @ (0x85 * 8 + 2)
#define                                 SPI1SSP_bit         _BIT_ACCESS(SPI1CON1,2)
// SPI1SSPPS<SPI1SSPPS0>
extern volatile __bit                   SPI1SSPPS0          __at(0x1360);	// @ (0x26C * 8 + 0)
#define                                 SPI1SSPPS0_bit      _BIT_ACCESS(SPI1SSPPS,0)
// SPI1SSPPS<SPI1SSPPS1>
extern volatile __bit                   SPI1SSPPS1          __at(0x1361);	// @ (0x26C * 8 + 1)
#define                                 SPI1SSPPS1_bit      _BIT_ACCESS(SPI1SSPPS,1)
// SPI1SSPPS<SPI1SSPPS2>
extern volatile __bit                   SPI1SSPPS2          __at(0x1362);	// @ (0x26C * 8 + 2)
#define                                 SPI1SSPPS2_bit      _BIT_ACCESS(SPI1SSPPS,2)
// SPI1SSPPS<SPI1SSPPS3>
extern volatile __bit                   SPI1SSPPS3          __at(0x1363);	// @ (0x26C * 8 + 3)
#define                                 SPI1SSPPS3_bit      _BIT_ACCESS(SPI1SSPPS,3)
// SPI1SSPPS<SPI1SSPPS4>
extern volatile __bit                   SPI1SSPPS4          __at(0x1364);	// @ (0x26C * 8 + 4)
#define                                 SPI1SSPPS4_bit      _BIT_ACCESS(SPI1SSPPS,4)
// SPI1SSPPS<SPI1SSPPS5>
extern volatile __bit                   SPI1SSPPS5          __at(0x1365);	// @ (0x26C * 8 + 5)
#define                                 SPI1SSPPS5_bit      _BIT_ACCESS(SPI1SSPPS,5)
// SPI1INTE<SPI1TCZIE>
extern volatile __bit                   SPI1TCZIE           __at(0x45E);	// @ (0x8B * 8 + 6)
#define                                 SPI1TCZIE_bit       _BIT_ACCESS(SPI1INTE,6)
// SPI1INTF<SPI1TCZIF>
extern volatile __bit                   SPI1TCZIF           __at(0x456);	// @ (0x8A * 8 + 6)
#define                                 SPI1TCZIF_bit       _BIT_ACCESS(SPI1INTF,6)
// SPI1STATUS<SPI1TXBE>
extern volatile __bit                   SPI1TXBE            __at(0x43D);	// @ (0x87 * 8 + 5)
#define                                 SPI1TXBE_bit        _BIT_ACCESS(SPI1STATUS,5)
// PIE3<SPI1TXIE>
extern volatile __bit                   SPI1TXIE            __at(0x2559);	// @ (0x4AB * 8 + 1)
#define                                 SPI1TXIE_bit        _BIT_ACCESS(PIE3,1)
// PIR3<SPI1TXIF>
extern volatile __bit                   SPI1TXIF            __at(0x25B1);	// @ (0x4B6 * 8 + 1)
#define                                 SPI1TXIF_bit        _BIT_ACCESS(PIR3,1)
// IPR3<SPI1TXIP>
extern volatile __bit                   SPI1TXIP            __at(0x1B51);	// @ (0x36A * 8 + 1)
#define                                 SPI1TXIP_bit        _BIT_ACCESS(IPR3,1)
// SPI1CON2<SPI1TXR>
extern volatile __bit                   SPI1TXR             __at(0x431);	// @ (0x86 * 8 + 1)
#define                                 SPI1TXR_bit         _BIT_ACCESS(SPI1CON2,1)
// SPI1INTE<SPI1TXUIE>
extern volatile __bit                   SPI1TXUIE           __at(0x459);	// @ (0x8B * 8 + 1)
#define                                 SPI1TXUIE_bit       _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<SPI1TXUIF>
extern volatile __bit                   SPI1TXUIF           __at(0x451);	// @ (0x8A * 8 + 1)
#define                                 SPI1TXUIF_bit       _BIT_ACCESS(SPI1INTF,1)
// SPI1STATUS<SPI1TXWE>
extern volatile __bit                   SPI1TXWE            __at(0x43F);	// @ (0x87 * 8 + 7)
#define                                 SPI1TXWE_bit        _BIT_ACCESS(SPI1STATUS,7)
// SPI2CON0<SPI2BMODE>
extern volatile __bit                   SPI2BMODE           __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 SPI2BMODE_bit       _BIT_ACCESS(SPI2CON0,0)
// SPI2CON2<SPI2BUSY>
extern volatile __bit                   SPI2BUSY            __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 SPI2BUSY_bit        _BIT_ACCESS(SPI2CON2,7)
// SPI2CON1<SPI2CKE>
extern volatile __bit                   SPI2CKE             __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 SPI2CKE_bit         _BIT_ACCESS(SPI2CON1,6)
// SPI2CON1<SPI2CKP>
extern volatile __bit                   SPI2CKP             __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 SPI2CKP_bit         _BIT_ACCESS(SPI2CON1,5)
// SPI2CLK<SPI2CLKSEL0>
extern volatile __bit                   SPI2CLKSEL0         __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SPI2CLKSEL0_bit     _BIT_ACCESS(SPI2CLK,0)
// SPI2CLK<SPI2CLKSEL1>
extern volatile __bit                   SPI2CLKSEL1         __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SPI2CLKSEL1_bit     _BIT_ACCESS(SPI2CLK,1)
// SPI2CLK<SPI2CLKSEL2>
extern volatile __bit                   SPI2CLKSEL2         __at(0x4CA);	// @ (0x99 * 8 + 2)
#define                                 SPI2CLKSEL2_bit     _BIT_ACCESS(SPI2CLK,2)
// SPI2CLK<SPI2CLKSEL3>
extern volatile __bit                   SPI2CLKSEL3         __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 SPI2CLKSEL3_bit     _BIT_ACCESS(SPI2CLK,3)
// SPI2STATUS<SPI2CLRBF>
extern volatile __bit                   SPI2CLRBF           __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 SPI2CLRBF_bit       _BIT_ACCESS(SPI2STATUS,2)
// SPI2INTE<SPI2EOSIE>
extern volatile __bit                   SPI2EOSIE           __at(0x4C4);	// @ (0x98 * 8 + 4)
#define                                 SPI2EOSIE_bit       _BIT_ACCESS(SPI2INTE,4)
// SPI2INTF<SPI2EOSIF>
extern volatile __bit                   SPI2EOSIF           __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 SPI2EOSIF_bit       _BIT_ACCESS(SPI2INTF,4)
// SPI2CON1<SPI2FST>
extern volatile __bit                   SPI2FST             __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 SPI2FST_bit         _BIT_ACCESS(SPI2CON1,4)
// PIE5<SPI2IE>
extern volatile __bit                   SPI2IE              __at(0x256A);	// @ (0x4AD * 8 + 2)
#define                                 SPI2IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<SPI2IF>
extern volatile __bit                   SPI2IF              __at(0x25C2);	// @ (0x4B8 * 8 + 2)
#define                                 SPI2IF_bit          _BIT_ACCESS(PIR5,2)
// IPR5<SPI2IP>
extern volatile __bit                   SPI2IP              __at(0x1B62);	// @ (0x36C * 8 + 2)
#define                                 SPI2IP_bit          _BIT_ACCESS(IPR5,2)
// SPI2CON0<SPI2LSBF>
extern volatile __bit                   SPI2LSBF            __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 SPI2LSBF_bit        _BIT_ACCESS(SPI2CON0,2)
// PMD3<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD3,5)
// SPI2CON0<SPI2MST>
extern volatile __bit                   SPI2MST             __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 SPI2MST_bit         _BIT_ACCESS(SPI2CON0,1)
// SPI2STATUS<SPI2RXBF>
extern volatile __bit                   SPI2RXBF            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 SPI2RXBF_bit        _BIT_ACCESS(SPI2STATUS,0)
// PIE5<SPI2RXIE>
extern volatile __bit                   SPI2RXIE            __at(0x2568);	// @ (0x4AD * 8 + 0)
#define                                 SPI2RXIE_bit        _BIT_ACCESS(PIE5,0)
// PIR5<SPI2RXIF>
extern volatile __bit                   SPI2RXIF            __at(0x25C0);	// @ (0x4B8 * 8 + 0)
#define                                 SPI2RXIF_bit        _BIT_ACCESS(PIR5,0)
// IPR5<SPI2RXIP>
extern volatile __bit                   SPI2RXIP            __at(0x1B60);	// @ (0x36C * 8 + 0)
#define                                 SPI2RXIP_bit        _BIT_ACCESS(IPR5,0)
// SPI2INTE<SPI2RXOIE>
extern volatile __bit                   SPI2RXOIE           __at(0x4C2);	// @ (0x98 * 8 + 2)
#define                                 SPI2RXOIE_bit       _BIT_ACCESS(SPI2INTE,2)
// SPI2INTF<SPI2RXOIF>
extern volatile __bit                   SPI2RXOIF           __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 SPI2RXOIF_bit       _BIT_ACCESS(SPI2INTF,2)
// SPI2CON2<SPI2RXR>
extern volatile __bit                   SPI2RXR             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 SPI2RXR_bit         _BIT_ACCESS(SPI2CON2,0)
// SPI2STATUS<SPI2RXRE>
extern volatile __bit                   SPI2RXRE            __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 SPI2RXRE_bit        _BIT_ACCESS(SPI2STATUS,3)
// SPI2SCKPPS<SPI2SCKPPS0>
extern volatile __bit                   SPI2SCKPPS0         __at(0x1368);	// @ (0x26D * 8 + 0)
#define                                 SPI2SCKPPS0_bit     _BIT_ACCESS(SPI2SCKPPS,0)
// SPI2SCKPPS<SPI2SCKPPS1>
extern volatile __bit                   SPI2SCKPPS1         __at(0x1369);	// @ (0x26D * 8 + 1)
#define                                 SPI2SCKPPS1_bit     _BIT_ACCESS(SPI2SCKPPS,1)
// SPI2SCKPPS<SPI2SCKPPS2>
extern volatile __bit                   SPI2SCKPPS2         __at(0x136A);	// @ (0x26D * 8 + 2)
#define                                 SPI2SCKPPS2_bit     _BIT_ACCESS(SPI2SCKPPS,2)
// SPI2SCKPPS<SPI2SCKPPS3>
extern volatile __bit                   SPI2SCKPPS3         __at(0x136B);	// @ (0x26D * 8 + 3)
#define                                 SPI2SCKPPS3_bit     _BIT_ACCESS(SPI2SCKPPS,3)
// SPI2SCKPPS<SPI2SCKPPS4>
extern volatile __bit                   SPI2SCKPPS4         __at(0x136C);	// @ (0x26D * 8 + 4)
#define                                 SPI2SCKPPS4_bit     _BIT_ACCESS(SPI2SCKPPS,4)
// SPI2SCKPPS<SPI2SCKPPS5>
extern volatile __bit                   SPI2SCKPPS5         __at(0x136D);	// @ (0x26D * 8 + 5)
#define                                 SPI2SCKPPS5_bit     _BIT_ACCESS(SPI2SCKPPS,5)
// SPI2CON1<SPI2SDIP>
extern volatile __bit                   SPI2SDIP            __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 SPI2SDIP_bit        _BIT_ACCESS(SPI2CON1,1)
// SPI2SDIPPS<SPI2SDIPPS0>
extern volatile __bit                   SPI2SDIPPS0         __at(0x1370);	// @ (0x26E * 8 + 0)
#define                                 SPI2SDIPPS0_bit     _BIT_ACCESS(SPI2SDIPPS,0)
// SPI2SDIPPS<SPI2SDIPPS1>
extern volatile __bit                   SPI2SDIPPS1         __at(0x1371);	// @ (0x26E * 8 + 1)
#define                                 SPI2SDIPPS1_bit     _BIT_ACCESS(SPI2SDIPPS,1)
// SPI2SDIPPS<SPI2SDIPPS2>
extern volatile __bit                   SPI2SDIPPS2         __at(0x1372);	// @ (0x26E * 8 + 2)
#define                                 SPI2SDIPPS2_bit     _BIT_ACCESS(SPI2SDIPPS,2)
// SPI2SDIPPS<SPI2SDIPPS3>
extern volatile __bit                   SPI2SDIPPS3         __at(0x1373);	// @ (0x26E * 8 + 3)
#define                                 SPI2SDIPPS3_bit     _BIT_ACCESS(SPI2SDIPPS,3)
// SPI2SDIPPS<SPI2SDIPPS4>
extern volatile __bit                   SPI2SDIPPS4         __at(0x1374);	// @ (0x26E * 8 + 4)
#define                                 SPI2SDIPPS4_bit     _BIT_ACCESS(SPI2SDIPPS,4)
// SPI2SDIPPS<SPI2SDIPPS5>
extern volatile __bit                   SPI2SDIPPS5         __at(0x1375);	// @ (0x26E * 8 + 5)
#define                                 SPI2SDIPPS5_bit     _BIT_ACCESS(SPI2SDIPPS,5)
// SPI2CON1<SPI2SDOP>
extern volatile __bit                   SPI2SDOP            __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 SPI2SDOP_bit        _BIT_ACCESS(SPI2CON1,0)
// SPI2CON1<SPI2SMP>
extern volatile __bit                   SPI2SMP             __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 SPI2SMP_bit         _BIT_ACCESS(SPI2CON1,7)
// SPI2INTE<SPI2SOSIE>
extern volatile __bit                   SPI2SOSIE           __at(0x4C5);	// @ (0x98 * 8 + 5)
#define                                 SPI2SOSIE_bit       _BIT_ACCESS(SPI2INTE,5)
// SPI2INTF<SPI2SOSIF>
extern volatile __bit                   SPI2SOSIF           __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 SPI2SOSIF_bit       _BIT_ACCESS(SPI2INTF,5)
// SPI2CON0<SPI2SPIEN>
extern volatile __bit                   SPI2SPIEN           __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 SPI2SPIEN_bit       _BIT_ACCESS(SPI2CON0,7)
// SPI2INTE<SPI2SRMTIE>
extern volatile __bit                   SPI2SRMTIE          __at(0x4C7);	// @ (0x98 * 8 + 7)
#define                                 SPI2SRMTIE_bit      _BIT_ACCESS(SPI2INTE,7)
// SPI2INTF<SPI2SRMTIF>
extern volatile __bit                   SPI2SRMTIF          __at(0x4BF);	// @ (0x97 * 8 + 7)
#define                                 SPI2SRMTIF_bit      _BIT_ACCESS(SPI2INTF,7)
// SPI2CON2<SPI2SSET>
extern volatile __bit                   SPI2SSET            __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 SPI2SSET_bit        _BIT_ACCESS(SPI2CON2,2)
// SPI2CON2<SPI2SSFLT>
extern volatile __bit                   SPI2SSFLT           __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 SPI2SSFLT_bit       _BIT_ACCESS(SPI2CON2,6)
// SPI2CON1<SPI2SSP>
extern volatile __bit                   SPI2SSP             __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 SPI2SSP_bit         _BIT_ACCESS(SPI2CON1,2)
// SPI2SSPPS<SPI2SSPPS0>
extern volatile __bit                   SPI2SSPPS0          __at(0x1378);	// @ (0x26F * 8 + 0)
#define                                 SPI2SSPPS0_bit      _BIT_ACCESS(SPI2SSPPS,0)
// SPI2SSPPS<SPI2SSPPS1>
extern volatile __bit                   SPI2SSPPS1          __at(0x1379);	// @ (0x26F * 8 + 1)
#define                                 SPI2SSPPS1_bit      _BIT_ACCESS(SPI2SSPPS,1)
// SPI2SSPPS<SPI2SSPPS2>
extern volatile __bit                   SPI2SSPPS2          __at(0x137A);	// @ (0x26F * 8 + 2)
#define                                 SPI2SSPPS2_bit      _BIT_ACCESS(SPI2SSPPS,2)
// SPI2SSPPS<SPI2SSPPS3>
extern volatile __bit                   SPI2SSPPS3          __at(0x137B);	// @ (0x26F * 8 + 3)
#define                                 SPI2SSPPS3_bit      _BIT_ACCESS(SPI2SSPPS,3)
// SPI2SSPPS<SPI2SSPPS4>
extern volatile __bit                   SPI2SSPPS4          __at(0x137C);	// @ (0x26F * 8 + 4)
#define                                 SPI2SSPPS4_bit      _BIT_ACCESS(SPI2SSPPS,4)
// SPI2SSPPS<SPI2SSPPS5>
extern volatile __bit                   SPI2SSPPS5          __at(0x137D);	// @ (0x26F * 8 + 5)
#define                                 SPI2SSPPS5_bit      _BIT_ACCESS(SPI2SSPPS,5)
// SPI2INTE<SPI2TCZIE>
extern volatile __bit                   SPI2TCZIE           __at(0x4C6);	// @ (0x98 * 8 + 6)
#define                                 SPI2TCZIE_bit       _BIT_ACCESS(SPI2INTE,6)
// SPI2INTF<SPI2TCZIF>
extern volatile __bit                   SPI2TCZIF           __at(0x4BE);	// @ (0x97 * 8 + 6)
#define                                 SPI2TCZIF_bit       _BIT_ACCESS(SPI2INTF,6)
// SPI2STATUS<SPI2TXBE>
extern volatile __bit                   SPI2TXBE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 SPI2TXBE_bit        _BIT_ACCESS(SPI2STATUS,5)
// PIE5<SPI2TXIE>
extern volatile __bit                   SPI2TXIE            __at(0x2569);	// @ (0x4AD * 8 + 1)
#define                                 SPI2TXIE_bit        _BIT_ACCESS(PIE5,1)
// PIR5<SPI2TXIF>
extern volatile __bit                   SPI2TXIF            __at(0x25C1);	// @ (0x4B8 * 8 + 1)
#define                                 SPI2TXIF_bit        _BIT_ACCESS(PIR5,1)
// IPR5<SPI2TXIP>
extern volatile __bit                   SPI2TXIP            __at(0x1B61);	// @ (0x36C * 8 + 1)
#define                                 SPI2TXIP_bit        _BIT_ACCESS(IPR5,1)
// SPI2CON2<SPI2TXR>
extern volatile __bit                   SPI2TXR             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 SPI2TXR_bit         _BIT_ACCESS(SPI2CON2,1)
// SPI2INTE<SPI2TXUIE>
extern volatile __bit                   SPI2TXUIE           __at(0x4C1);	// @ (0x98 * 8 + 1)
#define                                 SPI2TXUIE_bit       _BIT_ACCESS(SPI2INTE,1)
// SPI2INTF<SPI2TXUIF>
extern volatile __bit                   SPI2TXUIF           __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 SPI2TXUIF_bit       _BIT_ACCESS(SPI2INTF,1)
// SPI2STATUS<SPI2TXWE>
extern volatile __bit                   SPI2TXWE            __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 SPI2TXWE_bit        _BIT_ACCESS(SPI2STATUS,7)
// SMT1CON0<SPOL>
extern volatile __bit                   SPOL                __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SPOL_bit            _BIT_ACCESS(SMT1CON0,3)
// DMAnSPTRL<SPTR0>
extern volatile __bit                   SPTR0               __at(0x7A0);	// @ (0xF4 * 8 + 0)
#define                                 SPTR0_bit           _BIT_ACCESS(DMAnSPTRL,0)
// DMAnSPTRL<SPTR1>
extern volatile __bit                   SPTR1               __at(0x7A1);	// @ (0xF4 * 8 + 1)
#define                                 SPTR1_bit           _BIT_ACCESS(DMAnSPTRL,1)
// DMAnSPTRH<SPTR10>
extern volatile __bit                   SPTR10              __at(0x7AA);	// @ (0xF5 * 8 + 2)
#define                                 SPTR10_bit          _BIT_ACCESS(DMAnSPTRH,2)
// DMAnSPTRH<SPTR11>
extern volatile __bit                   SPTR11              __at(0x7AB);	// @ (0xF5 * 8 + 3)
#define                                 SPTR11_bit          _BIT_ACCESS(DMAnSPTRH,3)
// DMAnSPTRH<SPTR12>
extern volatile __bit                   SPTR12              __at(0x7AC);	// @ (0xF5 * 8 + 4)
#define                                 SPTR12_bit          _BIT_ACCESS(DMAnSPTRH,4)
// DMAnSPTRH<SPTR13>
extern volatile __bit                   SPTR13              __at(0x7AD);	// @ (0xF5 * 8 + 5)
#define                                 SPTR13_bit          _BIT_ACCESS(DMAnSPTRH,5)
// DMAnSPTRH<SPTR14>
extern volatile __bit                   SPTR14              __at(0x7AE);	// @ (0xF5 * 8 + 6)
#define                                 SPTR14_bit          _BIT_ACCESS(DMAnSPTRH,6)
// DMAnSPTRH<SPTR15>
extern volatile __bit                   SPTR15              __at(0x7AF);	// @ (0xF5 * 8 + 7)
#define                                 SPTR15_bit          _BIT_ACCESS(DMAnSPTRH,7)
// DMAnSPTRU<SPTR16>
extern volatile __bit                   SPTR16              __at(0x7B0);	// @ (0xF6 * 8 + 0)
#define                                 SPTR16_bit          _BIT_ACCESS(DMAnSPTRU,0)
// DMAnSPTRU<SPTR17>
extern volatile __bit                   SPTR17              __at(0x7B1);	// @ (0xF6 * 8 + 1)
#define                                 SPTR17_bit          _BIT_ACCESS(DMAnSPTRU,1)
// DMAnSPTRU<SPTR18>
extern volatile __bit                   SPTR18              __at(0x7B2);	// @ (0xF6 * 8 + 2)
#define                                 SPTR18_bit          _BIT_ACCESS(DMAnSPTRU,2)
// DMAnSPTRU<SPTR19>
extern volatile __bit                   SPTR19              __at(0x7B3);	// @ (0xF6 * 8 + 3)
#define                                 SPTR19_bit          _BIT_ACCESS(DMAnSPTRU,3)
// DMAnSPTRL<SPTR2>
extern volatile __bit                   SPTR2               __at(0x7A2);	// @ (0xF4 * 8 + 2)
#define                                 SPTR2_bit           _BIT_ACCESS(DMAnSPTRL,2)
// DMAnSPTRU<SPTR20>
extern volatile __bit                   SPTR20              __at(0x7B4);	// @ (0xF6 * 8 + 4)
#define                                 SPTR20_bit          _BIT_ACCESS(DMAnSPTRU,4)
// DMAnSPTRU<SPTR21>
extern volatile __bit                   SPTR21              __at(0x7B5);	// @ (0xF6 * 8 + 5)
#define                                 SPTR21_bit          _BIT_ACCESS(DMAnSPTRU,5)
// DMAnSPTRL<SPTR3>
extern volatile __bit                   SPTR3               __at(0x7A3);	// @ (0xF4 * 8 + 3)
#define                                 SPTR3_bit           _BIT_ACCESS(DMAnSPTRL,3)
