GopalSaraf/Practicals/PSDL/include/proc/pic18f14q41.h
extern volatile __bit                   TMR0IF              __at(0x25B7);	// @ (0x4B6 * 8 + 7)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR3,7)
// IPR3<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x1B57);	// @ (0x36A * 8 + 7)
#define                                 TMR0IP_bit          _BIT_ACCESS(IPR3,7)
// TMR0L<TMR0L0>
extern volatile __bit                   TMR0L0              __at(0x18C0);	// @ (0x318 * 8 + 0)
#define                                 TMR0L0_bit          _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR0L1>
extern volatile __bit                   TMR0L1              __at(0x18C1);	// @ (0x318 * 8 + 1)
#define                                 TMR0L1_bit          _BIT_ACCESS(TMR0L,1)
// TMR0L<TMR0L2>
extern volatile __bit                   TMR0L2              __at(0x18C2);	// @ (0x318 * 8 + 2)
#define                                 TMR0L2_bit          _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR0L3>
extern volatile __bit                   TMR0L3              __at(0x18C3);	// @ (0x318 * 8 + 3)
#define                                 TMR0L3_bit          _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR0L4>
extern volatile __bit                   TMR0L4              __at(0x18C4);	// @ (0x318 * 8 + 4)
#define                                 TMR0L4_bit          _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR0L5>
extern volatile __bit                   TMR0L5              __at(0x18C5);	// @ (0x318 * 8 + 5)
#define                                 TMR0L5_bit          _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR0L6>
extern volatile __bit                   TMR0L6              __at(0x18C6);	// @ (0x318 * 8 + 6)
#define                                 TMR0L6_bit          _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR0L7>
extern volatile __bit                   TMR0L7              __at(0x18C7);	// @ (0x318 * 8 + 7)
#define                                 TMR0L7_bit          _BIT_ACCESS(TMR0L,7)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// PIE3<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x255D);	// @ (0x4AB * 8 + 5)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE3,5)
// PIR3<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x25B5);	// @ (0x4B6 * 8 + 5)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR3,5)
// IPR3<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x1B55);	// @ (0x36A * 8 + 5)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR3,5)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x189B);	// @ (0x313 * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x189C);	// @ (0x313 * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x189D);	// @ (0x313 * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x189E);	// @ (0x313 * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x189F);	// @ (0x313 * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE3<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x255C);	// @ (0x4AB * 8 + 4)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x25B4);	// @ (0x4B6 * 8 + 4)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x1B54);	// @ (0x36A * 8 + 4)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR3,4)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x1894);	// @ (0x312 * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1896);	// @ (0x312 * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1897);	// @ (0x312 * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x18A0);	// @ (0x314 * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE3<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x255B);	// @ (0x4AB * 8 + 3)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x25B3);	// @ (0x4B6 * 8 + 3)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x1B53);	// @ (0x36A * 8 + 3)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x18F7);	// @ (0x31E * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// PIE4<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x2565);	// @ (0x4AC * 8 + 5)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE4,5)
// PIR4<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x25BD);	// @ (0x4B7 * 8 + 5)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR4,5)
// IPR4<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x1B5D);	// @ (0x36B * 8 + 5)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR4,5)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1920);	// @ (0x324 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1921);	// @ (0x324 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x1922);	// @ (0x324 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x1923);	// @ (0x324 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x2564);	// @ (0x4AC * 8 + 4)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x25BC);	// @ (0x4B7 * 8 + 4)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1B5C);	// @ (0x36B * 8 + 4)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR4,4)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1918);	// @ (0x323 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1928);	// @ (0x325 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE10<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x2593);	// @ (0x4B2 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x25EB);	// @ (0x4BD * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR10,3)
// IPR10<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1B8B);	// @ (0x371 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR10,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x195F);	// @ (0x32B * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// I2C1BTO<TOBY32>
extern volatile __bit                   TOBY32              __at(0x14E6);	// @ (0x29C * 8 + 6)
#define                                 TOBY32_bit          _BIT_ACCESS(I2C1BTO,6)
// I2C1BTO<TOREC>
extern volatile __bit                   TOREC               __at(0x14E7);	// @ (0x29C * 8 + 7)
#define                                 TOREC_bit           _BIT_ACCESS(I2C1BTO,7)
// I2C1BTO<TOTIME0>
extern volatile __bit                   TOTIME0             __at(0x14E0);	// @ (0x29C * 8 + 0)
#define                                 TOTIME0_bit         _BIT_ACCESS(I2C1BTO,0)
// I2C1BTO<TOTIME1>
extern volatile __bit                   TOTIME1             __at(0x14E1);	// @ (0x29C * 8 + 1)
#define                                 TOTIME1_bit         _BIT_ACCESS(I2C1BTO,1)
// I2C1BTO<TOTIME2>
extern volatile __bit                   TOTIME2             __at(0x14E2);	// @ (0x29C * 8 + 2)
#define                                 TOTIME2_bit         _BIT_ACCESS(I2C1BTO,2)
// I2C1BTO<TOTIME3>
extern volatile __bit                   TOTIME3             __at(0x14E3);	// @ (0x29C * 8 + 3)
#define                                 TOTIME3_bit         _BIT_ACCESS(I2C1BTO,3)
// I2C1BTO<TOTIME4>
extern volatile __bit                   TOTIME4             __at(0x14E4);	// @ (0x29C * 8 + 4)
#define                                 TOTIME4_bit         _BIT_ACCESS(I2C1BTO,4)
// I2C1BTO<TOTIME5>
extern volatile __bit                   TOTIME5             __at(0x14E5);	// @ (0x29C * 8 + 5)
#define                                 TOTIME5_bit         _BIT_ACCESS(I2C1BTO,5)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1B06);	// @ (0x360 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x2630);	// @ (0x4C6 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x2631);	// @ (0x4C6 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x2632);	// @ (0x4C6 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x2633);	// @ (0x4C6 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x2634);	// @ (0x4C6 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x2635);	// @ (0x4C6 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x263C);	// @ (0x4C7 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x263D);	// @ (0x4C7 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x263E);	// @ (0x4C7 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x263F);	// @ (0x4C7 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x2640);	// @ (0x4C8 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x2641);	// @ (0x4C8 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x2642);	// @ (0x4C8 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x2643);	// @ (0x4C8 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x2644);	// @ (0x4C8 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x2645);	// @ (0x4C8 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x2646);	// @ (0x4C8 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x2647);	// @ (0x4C8 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x1B08);	// @ (0x361 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x1B09);	// @ (0x361 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x1B0A);	// @ (0x361 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x1B0B);	// @ (0x361 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1EBD);	// @ (0x3D7 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1EBC);	// @ (0x3D7 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x580);	// @ (0xB0 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x581);	// @ (0xB0 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x582);	// @ (0xB0 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x583);	// @ (0xB0 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x584);	// @ (0xB0 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x585);	// @ (0xB0 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// I2C1CON1<TXU>
extern volatile __bit                   TXU                 __at(0x14A9);	// @ (0x295 * 8 + 1)
#define                                 TXU_bit             _BIT_ACCESS(I2C1CON1,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x155E);	// @ (0x2AB * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x158A);	// @ (0x2B1 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x158E);	// @ (0x2B1 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x159D);	// @ (0x2B3 * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x1595);	// @ (0x2B2 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x155F);	// @ (0x2AB * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1561);	// @ (0x2AC * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x156B);	// @ (0x2AD * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x159C);	// @ (0x2B3 * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x1594);	// @ (0x2B2 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// U1CTSPPS<U1CTSPPS0>
extern volatile __bit                   U1CTSPPS0           __at(0x1398);	// @ (0x273 * 8 + 0)
#define                                 U1CTSPPS0_bit       _BIT_ACCESS(U1CTSPPS,0)
// U1CTSPPS<U1CTSPPS1>
extern volatile __bit                   U1CTSPPS1           __at(0x1399);	// @ (0x273 * 8 + 1)
#define                                 U1CTSPPS1_bit       _BIT_ACCESS(U1CTSPPS,1)
// U1CTSPPS<U1CTSPPS2>
extern volatile __bit                   U1CTSPPS2           __at(0x139A);	// @ (0x273 * 8 + 2)
#define                                 U1CTSPPS2_bit       _BIT_ACCESS(U1CTSPPS,2)
// U1CTSPPS<U1CTSPPS3>
extern volatile __bit                   U1CTSPPS3           __at(0x139B);	// @ (0x273 * 8 + 3)
