GopalSaraf/Practicals/PSDL/include/proc/pic18f14q41.h
extern volatile __bit                   U2TXIE              __at(0x2581);	// @ (0x4B0 * 8 + 1)
#define                                 U2TXIE_bit          _BIT_ACCESS(PIE8,1)
// PIR8<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x25D9);	// @ (0x4BB * 8 + 1)
#define                                 U2TXIF_bit          _BIT_ACCESS(PIR8,1)
// IPR8<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x1B79);	// @ (0x36F * 8 + 1)
#define                                 U2TXIP_bit          _BIT_ACCESS(IPR8,1)
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0x1637);	// @ (0x2C6 * 8 + 7)
#define                                 U2TXMTIE_bit        _BIT_ACCESS(U2ERRIE,7)
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0x162F);	// @ (0x2C5 * 8 + 7)
#define                                 U2TXMTIF_bit        _BIT_ACCESS(U2ERRIR,7)
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0x1602);	// @ (0x2C0 * 8 + 2)
#define                                 U2TXPOL_bit         _BIT_ACCESS(U2CON2,2)
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0x161F);	// @ (0x2C3 * 8 + 7)
#define                                 U2TXWRE_bit         _BIT_ACCESS(U2FIFO,7)
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0x15FC);	// @ (0x2BF * 8 + 4)
#define                                 U2WUE_bit           _BIT_ACCESS(U2CON1,4)
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0x1627);	// @ (0x2C4 * 8 + 7)
#define                                 U2WUIF_bit          _BIT_ACCESS(U2UIR,7)
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0x161A);	// @ (0x2C3 * 8 + 2)
#define                                 U2XON_bit           _BIT_ACCESS(U2FIFO,2)
// U3CON0<U3ABDEN>
extern volatile __bit                   U3ABDEN             __at(0x168E);	// @ (0x2D1 * 8 + 6)
#define                                 U3ABDEN_bit         _BIT_ACCESS(U3CON0,6)
// U3UIR<U3ABDIE>
extern volatile __bit                   U3ABDIE             __at(0x16BA);	// @ (0x2D7 * 8 + 2)
#define                                 U3ABDIE_bit         _BIT_ACCESS(U3UIR,2)
// U3UIR<U3ABDIF>
extern volatile __bit                   U3ABDIF             __at(0x16BE);	// @ (0x2D7 * 8 + 6)
#define                                 U3ABDIF_bit         _BIT_ACCESS(U3UIR,6)
// U3ERRIE<U3ABDOVE>
extern volatile __bit                   U3ABDOVE            __at(0x16CD);	// @ (0x2D9 * 8 + 5)
#define                                 U3ABDOVE_bit        _BIT_ACCESS(U3ERRIE,5)
// U3ERRIR<U3ABDOVF>
extern volatile __bit                   U3ABDOVF            __at(0x16C5);	// @ (0x2D8 * 8 + 5)
#define                                 U3ABDOVF_bit        _BIT_ACCESS(U3ERRIR,5)
// U3CON0<U3BRGS>
extern volatile __bit                   U3BRGS              __at(0x168F);	// @ (0x2D1 * 8 + 7)
#define                                 U3BRGS_bit          _BIT_ACCESS(U3CON0,7)
// U3CON1<U3BRKOVR>
extern volatile __bit                   U3BRKOVR            __at(0x1691);	// @ (0x2D2 * 8 + 1)
#define                                 U3BRKOVR_bit        _BIT_ACCESS(U3CON1,1)
// U3ERRIE<U3CERIE>
extern volatile __bit                   U3CERIE             __at(0x16CC);	// @ (0x2D9 * 8 + 4)
#define                                 U3CERIE_bit         _BIT_ACCESS(U3ERRIE,4)
// U3ERRIR<U3CERIF>
extern volatile __bit                   U3CERIF             __at(0x16C4);	// @ (0x2D8 * 8 + 4)
#define                                 U3CERIF_bit         _BIT_ACCESS(U3ERRIR,4)
// U3CTSPPS<U3CTSPPS0>
extern volatile __bit                   U3CTSPPS0           __at(0x13B8);	// @ (0x277 * 8 + 0)
#define                                 U3CTSPPS0_bit       _BIT_ACCESS(U3CTSPPS,0)
// U3CTSPPS<U3CTSPPS1>
extern volatile __bit                   U3CTSPPS1           __at(0x13B9);	// @ (0x277 * 8 + 1)
#define                                 U3CTSPPS1_bit       _BIT_ACCESS(U3CTSPPS,1)
// U3CTSPPS<U3CTSPPS2>
extern volatile __bit                   U3CTSPPS2           __at(0x13BA);	// @ (0x277 * 8 + 2)
#define                                 U3CTSPPS2_bit       _BIT_ACCESS(U3CTSPPS,2)
// U3CTSPPS<U3CTSPPS3>
extern volatile __bit                   U3CTSPPS3           __at(0x13BB);	// @ (0x277 * 8 + 3)
#define                                 U3CTSPPS3_bit       _BIT_ACCESS(U3CTSPPS,3)
// U3CTSPPS<U3CTSPPS4>
extern volatile __bit                   U3CTSPPS4           __at(0x13BC);	// @ (0x277 * 8 + 4)
#define                                 U3CTSPPS4_bit       _BIT_ACCESS(U3CTSPPS,4)
// U3CTSPPS<U3CTSPPS5>
extern volatile __bit                   U3CTSPPS5           __at(0x13BD);	// @ (0x277 * 8 + 5)
#define                                 U3CTSPPS5_bit       _BIT_ACCESS(U3CTSPPS,5)
// PIE9<U3EIE>
extern volatile __bit                   U3EIE               __at(0x258A);	// @ (0x4B1 * 8 + 2)
#define                                 U3EIE_bit           _BIT_ACCESS(PIE9,2)
// PIR9<U3EIF>
extern volatile __bit                   U3EIF               __at(0x25E2);	// @ (0x4BC * 8 + 2)
#define                                 U3EIF_bit           _BIT_ACCESS(PIR9,2)
// IPR9<U3EIP>
extern volatile __bit                   U3EIP               __at(0x1B82);	// @ (0x370 * 8 + 2)
#define                                 U3EIP_bit           _BIT_ACCESS(IPR9,2)
// U3ERRIE<U3FERIE>
extern volatile __bit                   U3FERIE             __at(0x16CB);	// @ (0x2D9 * 8 + 3)
#define                                 U3FERIE_bit         _BIT_ACCESS(U3ERRIE,3)
// U3ERRIR<U3FERIF>
extern volatile __bit                   U3FERIF             __at(0x16C3);	// @ (0x2D8 * 8 + 3)
#define                                 U3FERIF_bit         _BIT_ACCESS(U3ERRIR,3)
// U3CON2<U3FLO0>
extern volatile __bit                   U3FLO0              __at(0x1698);	// @ (0x2D3 * 8 + 0)
#define                                 U3FLO0_bit          _BIT_ACCESS(U3CON2,0)
// U3CON2<U3FLO1>
extern volatile __bit                   U3FLO1              __at(0x1699);	// @ (0x2D3 * 8 + 1)
#define                                 U3FLO1_bit          _BIT_ACCESS(U3CON2,1)
// PIE9<U3IE>
extern volatile __bit                   U3IE                __at(0x258B);	// @ (0x4B1 * 8 + 3)
#define                                 U3IE_bit            _BIT_ACCESS(PIE9,3)
// PIR9<U3IF>
extern volatile __bit                   U3IF                __at(0x25E3);	// @ (0x4BC * 8 + 3)
#define                                 U3IF_bit            _BIT_ACCESS(PIR9,3)
// IPR9<U3IP>
extern volatile __bit                   U3IP                __at(0x1B83);	// @ (0x370 * 8 + 3)
#define                                 U3IP_bit            _BIT_ACCESS(IPR9,3)
// PMD4<U3MD>
extern volatile __bit                   U3MD                __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 U3MD_bit            _BIT_ACCESS(PMD4,0)
// U3CON0<U3MODE0>
extern volatile __bit                   U3MODE0             __at(0x1688);	// @ (0x2D1 * 8 + 0)
#define                                 U3MODE0_bit         _BIT_ACCESS(U3CON0,0)
// U3CON0<U3MODE1>
extern volatile __bit                   U3MODE1             __at(0x1689);	// @ (0x2D1 * 8 + 1)
#define                                 U3MODE1_bit         _BIT_ACCESS(U3CON0,1)
// U3CON0<U3MODE2>
extern volatile __bit                   U3MODE2             __at(0x168A);	// @ (0x2D1 * 8 + 2)
#define                                 U3MODE2_bit         _BIT_ACCESS(U3CON0,2)
// U3CON1<U3ON>
extern volatile __bit                   U3ON                __at(0x1697);	// @ (0x2D2 * 8 + 7)
#define                                 U3ON_bit            _BIT_ACCESS(U3CON1,7)
// U3ERRIE<U3PERIE>
extern volatile __bit                   U3PERIE             __at(0x16CE);	// @ (0x2D9 * 8 + 6)
#define                                 U3PERIE_bit         _BIT_ACCESS(U3ERRIE,6)
// U3ERRIR<U3PERIF>
extern volatile __bit                   U3PERIF             __at(0x16C6);	// @ (0x2D8 * 8 + 6)
#define                                 U3PERIF_bit         _BIT_ACCESS(U3ERRIR,6)
// U3FIFO<U3RCIDL>
extern volatile __bit                   U3RCIDL             __at(0x16B3);	// @ (0x2D6 * 8 + 3)
#define                                 U3RCIDL_bit         _BIT_ACCESS(U3FIFO,3)
// U3CON2<U3RUNOVF>
extern volatile __bit                   U3RUNOVF            __at(0x169F);	// @ (0x2D3 * 8 + 7)
#define                                 U3RUNOVF_bit        _BIT_ACCESS(U3CON2,7)
// U3FIFO<U3RXBE>
extern volatile __bit                   U3RXBE              __at(0x16B1);	// @ (0x2D6 * 8 + 1)
#define                                 U3RXBE_bit          _BIT_ACCESS(U3FIFO,1)
// U3FIFO<U3RXBF>
extern volatile __bit                   U3RXBF              __at(0x16B0);	// @ (0x2D6 * 8 + 0)
#define                                 U3RXBF_bit          _BIT_ACCESS(U3FIFO,0)
// U3CON1<U3RXBIMD>
extern volatile __bit                   U3RXBIMD            __at(0x1693);	// @ (0x2D2 * 8 + 3)
#define                                 U3RXBIMD_bit        _BIT_ACCESS(U3CON1,3)
// U3ERRIE<U3RXBKIE>
extern volatile __bit                   U3RXBKIE            __at(0x16CA);	// @ (0x2D9 * 8 + 2)
#define                                 U3RXBKIE_bit        _BIT_ACCESS(U3ERRIE,2)
// U3ERRIR<U3RXBKIF>
extern volatile __bit                   U3RXBKIF            __at(0x16C2);	// @ (0x2D8 * 8 + 2)
#define                                 U3RXBKIF_bit        _BIT_ACCESS(U3ERRIR,2)
// U3CON0<U3RXEN>
extern volatile __bit                   U3RXEN              __at(0x168C);	// @ (0x2D1 * 8 + 4)
#define                                 U3RXEN_bit          _BIT_ACCESS(U3CON0,4)
// U3ERRIE<U3RXFOIE>
extern volatile __bit                   U3RXFOIE            __at(0x16C9);	// @ (0x2D9 * 8 + 1)
#define                                 U3RXFOIE_bit        _BIT_ACCESS(U3ERRIE,1)
// U3ERRIR<U3RXFOIF>
extern volatile __bit                   U3RXFOIF            __at(0x16C1);	// @ (0x2D8 * 8 + 1)
#define                                 U3RXFOIF_bit        _BIT_ACCESS(U3ERRIR,1)
// U3FIFO<U3RXIDL>
extern volatile __bit                   U3RXIDL             __at(0x16B3);	// @ (0x2D6 * 8 + 3)
#define                                 U3RXIDL_bit         _BIT_ACCESS(U3FIFO,3)
// PIE9<U3RXIE>
extern volatile __bit                   U3RXIE              __at(0x2588);	// @ (0x4B1 * 8 + 0)
#define                                 U3RXIE_bit          _BIT_ACCESS(PIE9,0)
// PIR9<U3RXIF>
extern volatile __bit                   U3RXIF              __at(0x25E0);	// @ (0x4BC * 8 + 0)
#define                                 U3RXIF_bit          _BIT_ACCESS(PIR9,0)
// IPR9<U3RXIP>
extern volatile __bit                   U3RXIP              __at(0x1B80);	// @ (0x370 * 8 + 0)
#define                                 U3RXIP_bit          _BIT_ACCESS(IPR9,0)
// U3CON2<U3RXPOL>
extern volatile __bit                   U3RXPOL             __at(0x169E);	// @ (0x2D3 * 8 + 6)
#define                                 U3RXPOL_bit         _BIT_ACCESS(U3CON2,6)
// U3RXPPS<U3RXPPS0>
extern volatile __bit                   U3RXPPS0            __at(0x13B0);	// @ (0x276 * 8 + 0)
#define                                 U3RXPPS0_bit        _BIT_ACCESS(U3RXPPS,0)
// U3RXPPS<U3RXPPS1>
extern volatile __bit                   U3RXPPS1            __at(0x13B1);	// @ (0x276 * 8 + 1)
#define                                 U3RXPPS1_bit        _BIT_ACCESS(U3RXPPS,1)
// U3RXPPS<U3RXPPS2>
extern volatile __bit                   U3RXPPS2            __at(0x13B2);	// @ (0x276 * 8 + 2)
#define                                 U3RXPPS2_bit        _BIT_ACCESS(U3RXPPS,2)
// U3RXPPS<U3RXPPS3>
extern volatile __bit                   U3RXPPS3            __at(0x13B3);	// @ (0x276 * 8 + 3)
#define                                 U3RXPPS3_bit        _BIT_ACCESS(U3RXPPS,3)
// U3RXPPS<U3RXPPS4>
extern volatile __bit                   U3RXPPS4            __at(0x13B4);	// @ (0x276 * 8 + 4)
#define                                 U3RXPPS4_bit        _BIT_ACCESS(U3RXPPS,4)
// U3RXPPS<U3RXPPS5>
extern volatile __bit                   U3RXPPS5            __at(0x13B5);	// @ (0x276 * 8 + 5)
#define                                 U3RXPPS5_bit        _BIT_ACCESS(U3RXPPS,5)
// U3CON1<U3SENDB>
extern volatile __bit                   U3SENDB             __at(0x1690);	// @ (0x2D2 * 8 + 0)
#define                                 U3SENDB_bit         _BIT_ACCESS(U3CON1,0)
// U3CON2<U3STP0>
extern volatile __bit                   U3STP0              __at(0x169C);	// @ (0x2D3 * 8 + 4)
#define                                 U3STP0_bit          _BIT_ACCESS(U3CON2,4)
// U3CON2<U3STP1>
extern volatile __bit                   U3STP1              __at(0x169D);	// @ (0x2D3 * 8 + 5)
#define                                 U3STP1_bit          _BIT_ACCESS(U3CON2,5)
// U3FIFO<U3STPMD>
extern volatile __bit                   U3STPMD             __at(0x16B6);	// @ (0x2D6 * 8 + 6)
#define                                 U3STPMD_bit         _BIT_ACCESS(U3FIFO,6)
// U3FIFO<U3TXBE>
extern volatile __bit                   U3TXBE              __at(0x16B5);	// @ (0x2D6 * 8 + 5)
#define                                 U3TXBE_bit          _BIT_ACCESS(U3FIFO,5)
// U3FIFO<U3TXBF>
extern volatile __bit                   U3TXBF              __at(0x16B4);	// @ (0x2D6 * 8 + 4)
#define                                 U3TXBF_bit          _BIT_ACCESS(U3FIFO,4)
// U3ERRIE<U3TXCIE>
extern volatile __bit                   U3TXCIE             __at(0x16C8);	// @ (0x2D9 * 8 + 0)
#define                                 U3TXCIE_bit         _BIT_ACCESS(U3ERRIE,0)
// U3ERRIR<U3TXCIF>
extern volatile __bit                   U3TXCIF             __at(0x16C0);	// @ (0x2D8 * 8 + 0)
#define                                 U3TXCIF_bit         _BIT_ACCESS(U3ERRIR,0)
// U3CON0<U3TXEN>
extern volatile __bit                   U3TXEN              __at(0x168D);	// @ (0x2D1 * 8 + 5)
#define                                 U3TXEN_bit          _BIT_ACCESS(U3CON0,5)
// PIE9<U3TXIE>
extern volatile __bit                   U3TXIE              __at(0x2589);	// @ (0x4B1 * 8 + 1)
#define                                 U3TXIE_bit          _BIT_ACCESS(PIE9,1)
// PIR9<U3TXIF>
extern volatile __bit                   U3TXIF              __at(0x25E1);	// @ (0x4BC * 8 + 1)
#define                                 U3TXIF_bit          _BIT_ACCESS(PIR9,1)
// IPR9<U3TXIP>
extern volatile __bit                   U3TXIP              __at(0x1B81);	// @ (0x370 * 8 + 1)
#define                                 U3TXIP_bit          _BIT_ACCESS(IPR9,1)
// U3ERRIE<U3TXMTIE>
extern volatile __bit                   U3TXMTIE            __at(0x16CF);	// @ (0x2D9 * 8 + 7)
#define                                 U3TXMTIE_bit        _BIT_ACCESS(U3ERRIE,7)
// U3ERRIR<U3TXMTIF>
extern volatile __bit                   U3TXMTIF            __at(0x16C7);	// @ (0x2D8 * 8 + 7)
#define                                 U3TXMTIF_bit        _BIT_ACCESS(U3ERRIR,7)
// U3CON2<U3TXPOL>
extern volatile __bit                   U3TXPOL             __at(0x169A);	// @ (0x2D3 * 8 + 2)
#define                                 U3TXPOL_bit         _BIT_ACCESS(U3CON2,2)
// U3FIFO<U3TXWRE>
extern volatile __bit                   U3TXWRE             __at(0x16B7);	// @ (0x2D6 * 8 + 7)
#define                                 U3TXWRE_bit         _BIT_ACCESS(U3FIFO,7)
// U3CON1<U3WUE>
extern volatile __bit                   U3WUE               __at(0x1694);	// @ (0x2D2 * 8 + 4)
#define                                 U3WUE_bit           _BIT_ACCESS(U3CON1,4)
// U3UIR<U3WUIF>
extern volatile __bit                   U3WUIF              __at(0x16BF);	// @ (0x2D7 * 8 + 7)
#define                                 U3WUIF_bit          _BIT_ACCESS(U3UIR,7)
// U3FIFO<U3XON>
extern volatile __bit                   U3XON               __at(0x16B2);	// @ (0x2D6 * 8 + 2)
#define                                 U3XON_bit           _BIT_ACCESS(U3FIFO,2)
// ACTCON<UD>
extern volatile __bit                   UD                  __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 UD_bit              _BIT_ACCESS(ACTCON,6)
// OPA1CON0<UG>
extern volatile __bit                   UG                  __at(0x51B);	// @ (0xA3 * 8 + 3)
#define                                 UG_bit              _BIT_ACCESS(OPA1CON0,3)
// OPA1CON0<UG0>
extern volatile __bit                   UG0                 __at(0x51B);	// @ (0xA3 * 8 + 3)
#define                                 UG0_bit             _BIT_ACCESS(OPA1CON0,3)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VREGCON<VREGPM0>
extern volatile __bit                   VREGPM0             __at(0x240);	// @ (0x48 * 8 + 0)
#define                                 VREGPM0_bit         _BIT_ACCESS(VREGCON,0)
// VREGCON<VREGPM1>
extern volatile __bit                   VREGPM1             __at(0x241);	// @ (0x48 * 8 + 1)
#define                                 VREGPM1_bit         _BIT_ACCESS(VREGCON,1)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x3CC);	// @ (0x79 * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x3CD);	// @ (0x79 * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x3CE);	// @ (0x79 * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x3C3);	// @ (0x78 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x3C4);	// @ (0x78 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x3C5);	// @ (0x78 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x3E0);	// @ (0x7C * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x3E1);	// @ (0x7C * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x3E2);	// @ (0x7C * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x3E3);	// @ (0x7C * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x3E4);	// @ (0x7C * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x3E5);	// @ (0x7C * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x3E6);	// @ (0x7C * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x3E7);	// @ (0x7C * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x3C8);	// @ (0x79 * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x3C9);	// @ (0x79 * 8 + 1)
